In [1]:
import pandas as pd
import numpy as np

# prod to interpolate

In [3]:
pd.Series([], dtype="float64").prod()

np.float64(1.0)

In [4]:
pd.Series([], dtype="float64").prod(min_count=1)

np.float64(nan)

In [5]:
pd.Series([np.nan]).prod()

np.float64(1.0)

In [6]:
pd.Series([np.nan]).prod(min_count=1)

np.float64(nan)

In [7]:
pd.Series([], dtype="float64").prod()

np.float64(1.0)

In [8]:
pd.Series([], dtype="float64").prod(min_count=1)

np.float64(nan)

In [9]:
pd.Series([np.nan]).prod()

np.float64(1.0)

In [10]:
pd.Series([np.nan]).prod(min_count=1)

np.float64(nan)

In [11]:
df = pd.DataFrame(np.array([[1, 1], [2, 10], [3, 100], [4, 100]]),
                  columns=['a', 'b'])

In [12]:
df.quantile(.1)

a    1.3
b    3.7
Name: 0.1, dtype: float64

In [13]:
df.quantile([.1, .5])

       a     b
0.1  1.3   3.7
0.5  2.5  55.0

In [14]:
df.quantile(.1, method="table", interpolation="nearest")

a    1
b    1
Name: 0.1, dtype: int64

In [15]:
df.quantile([.1, .5], method="table", interpolation="nearest")

     a    b
0.1  1    1
0.5  3  100

In [16]:
df = pd.DataFrame({'A': [1, 2],
                   'B': [pd.Timestamp('2010'),
                         pd.Timestamp('2011')],
                   'C': [pd.Timedelta('1 days'),
                         pd.Timedelta('2 days')]})

In [17]:
df.quantile(0.5, numeric_only=False)

A                    1.5
B    2010-07-02 12:00:00
C        1 days 12:00:00
Name: 0.5, dtype: object

In [18]:
df = pd.DataFrame(data={'Animal': ['cat', 'penguin', 'dog',
                                   'spider', 'snake'],
                        'Number_legs': [4, 2, 4, 8, np.nan]})

In [19]:
df

    Animal  Number_legs
0      cat          4.0
1  penguin          2.0
2      dog          4.0
3   spider          8.0
4    snake          NaN

In [20]:
s = pd.Series(range(5), index=list("abcde"))

In [21]:
s["d"] = s["b"]
s.rank()

a    1.0
b    2.5
c    4.0
d    2.5
e    5.0
dtype: float64

In [22]:
df['default_rank'] = df['Number_legs'].rank()
df['max_rank'] = df['Number_legs'].rank(method='max')
df['NA_bottom'] = df['Number_legs'].rank(na_option='bottom')
df['pct_rank'] = df['Number_legs'].rank(pct=True)
df

    Animal  Number_legs  default_rank  max_rank  NA_bottom  pct_rank
0      cat          4.0           2.5       3.0        2.5     0.625
1  penguin          2.0           1.0       1.0        1.0     0.250
2      dog          4.0           2.5       3.0        2.5     0.625
3   spider          8.0           4.0       4.0        4.0     1.000
4    snake          NaN           NaN       NaN        5.0       NaN

In [23]:
df = pd.DataFrame([(.21, .32), (.01, .67), (.66, .03), (.21, .18)],
                  columns=['dogs', 'cats'])
df

   dogs  cats
0  0.21  0.32
1  0.01  0.67
2  0.66  0.03
3  0.21  0.18

In [24]:
df.round()

   dogs  cats
0   0.0   0.0
1   0.0   1.0
2   1.0   0.0
3   0.0   0.0

In [25]:
df.round(1)

   dogs  cats
0   0.2   0.3
1   0.0   0.7
2   0.7   0.0
3   0.2   0.2

In [26]:
df.round({'dogs': 1, 'cats': 0})

   dogs  cats
0   0.2   0.0
1   0.0   1.0
2   0.7   0.0
3   0.2   0.0

In [27]:
decimals = pd.Series([0, 1], index=['cats', 'dogs'])

In [28]:
df.round(decimals)

   dogs  cats
0   0.2   0.0
1   0.0   1.0
2   0.7   0.0
3   0.2   0.0

In [29]:
s = pd.Series([1, 2, 3])
s.sem().round(6)

np.float64(0.57735)

In [30]:
s

0    1
1    2
2    3
dtype: int64

In [31]:
df = pd.DataFrame({'a': [1, 2], 'b': [2, 3]}, index=['tiger', 'zebra'])
df

       a  b
tiger  1  2
zebra  2  3

In [32]:
df.sem()

a    0.5
b    0.5
dtype: float64

In [33]:
df.sem(axis=1)

tiger    0.5
zebra    0.5
dtype: float64

In [34]:
df = pd.DataFrame({'a': [1, 2], 'b': ['T', 'Z']},
                  index=['tiger', 'zebra'])

In [35]:
df.sem(numeric_only=True)

a    0.5
dtype: float64

In [36]:
s = pd.Series([1, 2, 3])
s.skew()

np.float64(0.0)

In [37]:
s

0    1
1    2
2    3
dtype: int64

In [38]:
df = pd.DataFrame({'a': [1, 2, 3], 'b': [2, 3, 4], 'c': [1, 3, 5]},
                  index=['tiger', 'zebra', 'cow'])

In [39]:
df

       a  b  c
tiger  1  2  1
zebra  2  3  3
cow    3  4  5

In [40]:
df.skew()

a    0.0
b    0.0
c    0.0
dtype: float64

In [41]:
df.skew(axis=1)

tiger    1.732051
zebra   -1.732051
cow      0.000000
dtype: float64

In [42]:
df = pd.DataFrame({'a': [1, 2, 3], 'b': ['T', 'Z', 'X']},
                  index=['tiger', 'zebra', 'cow'])

In [43]:
df.skew(numeric_only=True)

a    0.0
dtype: float64

In [44]:
idx = pd.MultiIndex.from_arrays([
    ['warm', 'warm', 'cold', 'cold'],
    ['dog', 'falcon', 'fish', 'spider']],
    names=['blooded', 'animal'])

In [45]:
idx

MultiIndex([('warm',    'dog'),
            ('warm', 'falcon'),
            ('cold',   'fish'),
            ('cold', 'spider')],
           names=['blooded', 'animal'])

In [46]:
s = pd.Series([4, 2, 0, 8], name='legs', index=idx)
s

blooded  animal
warm     dog       4
         falcon    2
cold     fish      0
         spider    8
Name: legs, dtype: int64

In [47]:
s.sum()

np.int64(14)

In [48]:
pd.Series([], dtype="float64").sum()  # min_count=0 is the default

np.float64(0.0)

In [49]:
pd.Series([], dtype="float64").sum(min_count=1)

np.float64(nan)

In [50]:
pd.Series([np.nan]).sum()

np.float64(0.0)

In [51]:
pd.Series([np.nan]).sum(min_count=1)

np.float64(nan)

In [52]:
df = pd.DataFrame({'person_id': [0, 1, 2, 3],
                   'age': [21, 25, 62, 43],
                   'height': [1.61, 1.87, 1.49, 2.01]}
                  ).set_index('person_id')

In [53]:
df

           age  height
person_id
0           21    1.61
1           25    1.87
2           62    1.49
3           43    2.01

In [54]:
df.std()

age       18.786076
height     0.237417
dtype: float64

In [55]:
df.std(ddof=0)

age       16.269219
height     0.205609
dtype: float64

In [56]:
df = pd.DataFrame({'person_id': [0, 1, 2, 3],
                   'age': [21, 25, 62, 43],
                   'height': [1.61, 1.87, 1.49, 2.01]}
                  ).set_index('person_id')
df

           age  height
person_id
0           21    1.61
1           25    1.87
2           62    1.49
3           43    2.01

In [57]:
df.var()

age       352.916667
height      0.056367
dtype: float64

In [58]:
df.var(ddof=0)

age       264.687500
height      0.042275
dtype: float64

In [59]:
df = pd.DataFrame({'A': [4, 5, 6], 'B': [4, 1, 1]})
df.nunique()

A    3
B    2
dtype: int64

In [61]:
df.nunique(axis=1)

0    1
1    2
2    2
dtype: int64

In [62]:
df = pd.DataFrame({'num_legs': [2, 4, 4, 6],
                   'num_wings': [2, 0, 0, 0]},
                  index=['falcon', 'dog', 'cat', 'ant'])

In [63]:
df

        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            6          0

In [64]:
df.value_counts()

num_legs  num_wings
4         0            2
2         2            1
6         0            1
Name: count, dtype: int64

In [65]:
df.value_counts(sort=False)

num_legs  num_wings
2         2            1
4         0            2
6         0            1
Name: count, dtype: int64

In [66]:
df.value_counts(ascending=True)

num_legs  num_wings
2         2            1
6         0            1
4         0            2
Name: count, dtype: int64

In [67]:
df.value_counts(normalize=True)

num_legs  num_wings
4         0            0.50
2         2            0.25
6         0            0.25
Name: proportion, dtype: float64

In [68]:
df = pd.DataFrame({'first_name': ['John', 'Anne', 'John', 'Beth'],
                   'middle_name': ['Smith', pd.NA, pd.NA, 'Louise']})
df

  first_name middle_name
0       John       Smith
1       Anne        <NA>
2       John        <NA>
3       Beth      Louise

In [69]:
df.value_counts(dropna=False)

first_name  middle_name
Anne        NaN            1
Beth        Louise         1
John        Smith          1
            NaN            1
Name: count, dtype: int64

In [70]:
df.value_counts()

first_name  middle_name
Beth        Louise         1
John        Smith          1
Name: count, dtype: int64

In [71]:
df.value_counts(dropna=False)

first_name  middle_name
Anne        NaN            1
Beth        Louise         1
John        Smith          1
            NaN            1
Name: count, dtype: int64

In [72]:
df.value_counts("first_name")

first_name
John    2
Anne    1
Beth    1
Name: count, dtype: int64

In [73]:
s = pd.Series([1, 2, 3, 4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [74]:
s.add_prefix('item_')

item_0    1
item_1    2
item_2    3
item_3    4
dtype: int64

In [75]:
df = pd.DataFrame({'A': [1, 2, 3, 4], 'B': [3, 4, 5, 6]})
df

   A  B
0  1  3
1  2  4
2  3  5
3  4  6

In [76]:
df.add_prefix('col_')

   col_A  col_B
0      1      3
1      2      4
2      3      5
3      4      6

In [77]:
s = pd.Series([1, 2, 3, 4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [78]:
s.add_suffix('_item')

0_item    1
1_item    2
2_item    3
3_item    4
dtype: int64

In [79]:
df = pd.DataFrame({'A': [1, 2, 3, 4], 'B': [3, 4, 5, 6]})

In [80]:
df

   A  B
0  1  3
1  2  4
2  3  5
3  4  6

In [81]:
df.add_suffix('_col')

   A_col  B_col
0      1      3
1      2      4
2      3      5
3      4      6

In [82]:
df = pd.DataFrame(
    [[1, 2, 3, 4], [6, 7, 8, 9]], columns=["D", "B", "E", "A"], index=[1, 2]
)

In [83]:
df

   D  B  E  A
1  1  2  3  4
2  6  7  8  9

In [84]:
other = pd.DataFrame(
    [[10, 20, 30, 40], [60, 70, 80, 90], [600, 700, 800, 900]],
    columns=["A", "B", "C", "D"],
    index=[2, 3, 4],
)

In [85]:
other

     A    B    C    D
2   10   20   30   40
3   60   70   80   90
4  600  700  800  900

In [86]:
df

   D  B  E  A
1  1  2  3  4
2  6  7  8  9

In [87]:
left, right = df.align(other, join="outer", axis=1)
left

   A  B   C  D  E
1  4  2 NaN  1  3
2  9  7 NaN  6  8

In [88]:
right

     A    B    C    D   E
2   10   20   30   40 NaN
3   60   70   80   90 NaN
4  600  700  800  900 NaN

In [89]:
left, right = df.align(other, join="outer", axis=0)
left

     D    B    E    A
1  1.0  2.0  3.0  4.0
2  6.0  7.0  8.0  9.0
3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN

In [90]:
right

       A      B      C      D
1    NaN    NaN    NaN    NaN
2   10.0   20.0   30.0   40.0
3   60.0   70.0   80.0   90.0
4  600.0  700.0  800.0  900.0

In [91]:
left, right = df.align(other, join="outer", axis=None)
left

     A    B   C    D    E
1  4.0  2.0 NaN  1.0  3.0
2  9.0  7.0 NaN  6.0  8.0
3  NaN  NaN NaN  NaN  NaN
4  NaN  NaN NaN  NaN  NaN

In [92]:
right

       A      B      C      D   E
1    NaN    NaN    NaN    NaN NaN
2   10.0   20.0   30.0   40.0 NaN
3   60.0   70.0   80.0   90.0 NaN
4  600.0  700.0  800.0  900.0 NaN

In [93]:
i = pd.date_range('2018-04-09', periods=4, freq='12h')

In [94]:
i

DatetimeIndex(['2018-04-09 00:00:00', '2018-04-09 12:00:00',
               '2018-04-10 00:00:00', '2018-04-10 12:00:00'],
              dtype='datetime64[ns]', freq='12h')

In [95]:
ts = pd.DataFrame({'A': [1, 2, 3, 4]}, index=i)
ts

                     A
2018-04-09 00:00:00  1
2018-04-09 12:00:00  2
2018-04-10 00:00:00  3
2018-04-10 12:00:00  4

In [96]:
ts.at_time('12:00')

                     A
2018-04-09 12:00:00  2
2018-04-10 12:00:00  4

In [97]:
i = pd.date_range('2018-04-09', periods=4, freq='1D20min')

In [98]:
i

DatetimeIndex(['2018-04-09 00:00:00', '2018-04-10 00:20:00',
               '2018-04-11 00:40:00', '2018-04-12 01:00:00'],
              dtype='datetime64[ns]', freq='1460min')

In [99]:
ts = pd.DataFrame({'A': [1, 2, 3, 4]}, index=i)
ts

                     A
2018-04-09 00:00:00  1
2018-04-10 00:20:00  2
2018-04-11 00:40:00  3
2018-04-12 01:00:00  4

In [100]:
ts.between_time('0:15', '0:45')

                     A
2018-04-10 00:20:00  2
2018-04-11 00:40:00  3

In [101]:
ts.between_time('0:45', '0:15')

                     A
2018-04-09 00:00:00  1
2018-04-12 01:00:00  4

In [102]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [103]:
df.drop(['B', 'C'], axis=1)

   A   D
0  0   3
1  4   7
2  8  11

In [104]:
df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

In [105]:
df.drop([0, 1])

   A  B   C   D
2  8  9  10  11

In [106]:
midx = pd.MultiIndex(levels=[['llama', 'cow', 'falcon'],
                             ['speed', 'weight', 'length']],
                     codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
                            [0, 1, 2, 0, 1, 2, 0, 1, 2]])

In [107]:
midx

MultiIndex([( 'llama',  'speed'),
            ( 'llama', 'weight'),
            ( 'llama', 'length'),
            (   'cow',  'speed'),
            (   'cow', 'weight'),
            (   'cow', 'length'),
            ('falcon',  'speed'),
            ('falcon', 'weight'),
            ('falcon', 'length')],
           )

In [108]:
df = pd.DataFrame(index=midx, columns=['big', 'small'],
                  data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
                        [250, 150], [1.5, 0.8], [320, 250],
                        [1, 0.8], [0.3, 0.2]])

In [109]:
df

                 big  small
llama  speed    45.0   30.0
       weight  200.0  100.0
       length    1.5    1.0
cow    speed    30.0   20.0
       weight  250.0  150.0
       length    1.5    0.8
falcon speed   320.0  250.0
       weight    1.0    0.8
       length    0.3    0.2

In [110]:
df.drop(index=('falcon', 'weight'))

                 big  small
llama  speed    45.0   30.0
       weight  200.0  100.0
       length    1.5    1.0
cow    speed    30.0   20.0
       weight  250.0  150.0
       length    1.5    0.8
falcon speed   320.0  250.0
       length    0.3    0.2

In [111]:
df.drop(index='cow', columns='small')

                 big
llama  speed    45.0
       weight  200.0
       length    1.5
falcon speed   320.0
       weight    1.0
       length    0.3

In [112]:
df.drop(index='length', level=1)

                 big  small
llama  speed    45.0   30.0
       weight  200.0  100.0
cow    speed    30.0   20.0
       weight  250.0  150.0
falcon speed   320.0  250.0
       weight    1.0    0.8

In [113]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [114]:
df.drop_duplicates()

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [115]:
df.drop_duplicates(subset=['brand'])

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5

In [116]:
df.drop_duplicates(subset=['brand', 'style'], keep='last')

     brand style  rating
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
4  Indomie  pack     5.0

In [117]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})

In [118]:
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [119]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [120]:
df.duplicated(keep='last')

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [121]:
df.duplicated(keep=False)

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [122]:
df.duplicated(subset=['brand'])

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [123]:
df = pd.DataFrame({1: [10], 2: [20]})

In [124]:
df

    1   2
0  10  20

In [125]:
exactly_equal = pd.DataFrame({1: [10], 2: [20]})

In [126]:
exactly_equal

    1   2
0  10  20

In [127]:
different_column_type = pd.DataFrame({1.0: [10], 2.0: [20]})

In [128]:
different_column_type

   1.0  2.0
0   10   20

In [129]:
df.equals(different_column_type)

True

In [130]:
different_data_type = pd.DataFrame({1: [10.0], 2: [20.0]})

In [131]:
different_data_type

      1     2
0  10.0  20.0

In [132]:
df.equals(different_data_type)

False

In [133]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                  index=['mouse', 'rabbit'],
                  columns=['one', 'two', 'three'])

In [134]:
df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [135]:
# select columns by name
df.filter(items=['one', 'three'])

        one  three
mouse     1      3
rabbit    4      6

In [136]:
# select columns by regular expression
df.filter(regex='e$', axis=1)

        one  three
mouse     1      3
rabbit    4      6

In [137]:
# select rows containing 'bbi'
df.filter(like='bbi', axis=0)

        one  two  three
rabbit    4    5      6

In [138]:
i = pd.date_range('2018-04-09', periods=4, freq='2D')
ts = pd.DataFrame({'A': [1, 2, 3, 4]}, index=i)

In [139]:
ts

            A
2018-04-09  1
2018-04-11  2
2018-04-13  3
2018-04-15  4

In [140]:
ts.first('3D')

C:\Users\Admin\AppData\Local\Temp\ipykernel_5976\4005231089.py:1: FutureWarning: first is deprecated and will be removed in a future version. Please create a mask and filter using `.loc` instead
  ts.first('3D')

            A
2018-04-09  1
2018-04-11  2

In [141]:
df = pd.DataFrame({'consumption': [10.51, 103.11, 55.48],
                    'co2_emissions': [37.2, 19.66, 1712]},
                  index=['Pork', 'Wheat Products', 'Beef'])

In [142]:
df

                consumption  co2_emissions
Pork                  10.51          37.20
Wheat Products       103.11          19.66
Beef                  55.48        1712.00

In [143]:
df.idxmax()

consumption      Wheat Products
co2_emissions              Beef
dtype: object

In [144]:
df.idxmax(axis="columns")

Pork              co2_emissions
Wheat Products      consumption
Beef              co2_emissions
dtype: object

In [145]:
df = pd.DataFrame({'consumption': [10.51, 103.11, 55.48],
                    'co2_emissions': [37.2, 19.66, 1712]},
                  index=['Pork', 'Wheat Products', 'Beef'])

In [146]:
df

                consumption  co2_emissions
Pork                  10.51          37.20
Wheat Products       103.11          19.66
Beef                  55.48        1712.00

In [147]:
df.idxmin()

consumption                Pork
co2_emissions    Wheat Products
dtype: object

In [148]:
df.idxmin(axis="columns")

Pork                consumption
Wheat Products    co2_emissions
Beef                consumption
dtype: object

In [149]:
i = pd.date_range('2018-04-09', periods=4, freq='2D')
ts = pd.DataFrame({'A': [1, 2, 3, 4]}, index=i)
ts

            A
2018-04-09  1
2018-04-11  2
2018-04-13  3
2018-04-15  4

In [150]:
ts.last('3D')

C:\Users\Admin\AppData\Local\Temp\ipykernel_5976\2451076429.py:1: FutureWarning: last is deprecated and will be removed in a future version. Please create a mask and filter using `.loc` instead
  ts.last('3D')

            A
2018-04-13  3
2018-04-15  4

In [151]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                  'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},
                  index=index)

In [152]:
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [153]:
index

['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']

In [154]:
new_index = ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10',
             'Chrome']

In [155]:
df.reindex(new_index)

               http_status  response_time
Safari               404.0           0.07
Iceweasel              NaN            NaN
Comodo Dragon          NaN            NaN
IE10                 404.0           0.08
Chrome               200.0           0.02

In [156]:
df.reindex(new_index, fill_value=0)

               http_status  response_time
Safari                 404           0.07
Iceweasel                0           0.00
Comodo Dragon            0           0.00
IE10                   404           0.08
Chrome                 200           0.02

In [157]:
df.reindex(new_index, fill_value='missing')

              http_status response_time
Safari                404          0.07
Iceweasel         missing       missing
Comodo Dragon     missing       missing
IE10                  404          0.08
Chrome                200          0.02

In [158]:
df.reindex(columns=['http_status', 'user_agent'])

           http_status  user_agent
Firefox            200         NaN
Chrome             200         NaN
Safari             404         NaN
IE10               404         NaN
Konqueror          301         NaN

In [159]:
df.reindex(['http_status', 'user_agent'], axis="columns")

           http_status  user_agent
Firefox            200         NaN
Chrome             200         NaN
Safari             404         NaN
IE10               404         NaN
Konqueror          301         NaN

In [160]:
date_index = pd.date_range('1/1/2010', periods=6, freq='D')
df2 = pd.DataFrame({"prices": [100, 101, np.nan, 100, 89, 88]},
                   index=date_index)

In [161]:
date_index

DatetimeIndex(['2010-01-01', '2010-01-02', '2010-01-03', '2010-01-04',
               '2010-01-05', '2010-01-06'],
              dtype='datetime64[ns]', freq='D')

In [162]:
df2

            prices
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0

In [163]:
date_index2 = pd.date_range('12/29/2009', periods=10, freq='D')

In [164]:
date_index2

DatetimeIndex(['2009-12-29', '2009-12-30', '2009-12-31', '2010-01-01',
               '2010-01-02', '2010-01-03', '2010-01-04', '2010-01-05',
               '2010-01-06', '2010-01-07'],
              dtype='datetime64[ns]', freq='D')

In [165]:
df2.reindex(date_index2)

            prices
2009-12-29     NaN
2009-12-30     NaN
2009-12-31     NaN
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0
2010-01-07     NaN

In [166]:
df2.reindex(date_index2, method='bfill')

            prices
2009-12-29   100.0
2009-12-30   100.0
2009-12-31   100.0
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0
2010-01-07     NaN

In [167]:
df1 = pd.DataFrame([[24.3, 75.7, 'high'],
                    [31, 87.8, 'high'],
                    [22, 71.6, 'medium'],
                    [35, 95, 'medium']],
                   columns=['temp_celsius', 'temp_fahrenheit',
                            'windspeed'],
                   index=pd.date_range(start='2014-02-12',
                                       end='2014-02-15', freq='D'))

In [168]:
df1

            temp_celsius  temp_fahrenheit windspeed
2014-02-12          24.3             75.7      high
2014-02-13          31.0             87.8      high
2014-02-14          22.0             71.6    medium
2014-02-15          35.0             95.0    medium

In [169]:
df2 = pd.DataFrame([[28, 'low'],
                    [30, 'low'],
                    [35.1, 'medium']],
                   columns=['temp_celsius', 'windspeed'],
                   index=pd.DatetimeIndex(['2014-02-12', '2014-02-13',
                                           '2014-02-15']))

In [170]:
df2

            temp_celsius windspeed
2014-02-12          28.0       low
2014-02-13          30.0       low
2014-02-15          35.1    medium

In [171]:
df2.reindex_like(df1)

            temp_celsius  temp_fahrenheit windspeed
2014-02-12          28.0              NaN       low
2014-02-13          30.0              NaN       low
2014-02-14           NaN              NaN       NaN
2014-02-15          35.1              NaN    medium

In [172]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df.rename(columns={"A": "a", "B": "c"})

   a  c
0  1  4
1  2  5
2  3  6

In [173]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [174]:
df.rename(index={0: "x", 1: "y", 2: "z"})

   A  B
x  1  4
y  2  5
z  3  6

In [175]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [176]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [177]:
df.rename(index=str).index

Index(['0', '1', '2'], dtype='object')

In [179]:
df.rename(columns={"A": "a", "B": "b", "C": "c"}, errors="raise")

KeyError: "['C'] not found in axis"

In [180]:
df.rename(str.lower, axis='columns')

   a  b
0  1  4
1  2  5
2  3  6

In [181]:
df.rename({1: 2, 2: 4}, axis='index')

   A  B
0  1  4
2  2  5
4  3  6

In [182]:
s = pd.Series(["dog", "cat", "monkey"])

In [183]:
s

0       dog
1       cat
2    monkey
dtype: object

In [184]:
s.rename_axis("animal")

animal
0       dog
1       cat
2    monkey
dtype: object

In [185]:
df = pd.DataFrame({"num_legs": [4, 4, 2],
                   "num_arms": [0, 0, 2]},
                  ["dog", "cat", "monkey"])

In [186]:
df

        num_legs  num_arms
dog            4         0
cat            4         0
monkey         2         2

In [187]:
df = df.rename_axis("animal")

In [188]:
df

        num_legs  num_arms
animal
dog            4         0
cat            4         0
monkey         2         2

In [189]:
df = df.rename_axis("limbs", axis="columns")

In [190]:
df

limbs   num_legs  num_arms
animal
dog            4         0
cat            4         0
monkey         2         2

In [191]:
df.index = pd.MultiIndex.from_product([['mammal'],
                                       ['dog', 'cat', 'monkey']],
                                      names=['type', 'name'])

In [192]:
df

limbs          num_legs  num_arms
type   name
mammal dog            4         0
       cat            4         0
       monkey         2         2

In [193]:
df.rename_axis(index={'type': 'class'})

limbs          num_legs  num_arms
class  name
mammal dog            4         0
       cat            4         0
       monkey         2         2

In [194]:
df.rename_axis(columns=str.upper)

LIMBS          num_legs  num_arms
type   name
mammal dog            4         0
       cat            4         0
       monkey         2         2

In [195]:
df

limbs          num_legs  num_arms
type   name
mammal dog            4         0
       cat            4         0
       monkey         2         2

In [196]:
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                  index=['falcon', 'parrot', 'lion', 'monkey'],
                  columns=('class', 'max_speed'))

In [197]:
df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [198]:
df.reset_index()

    index   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [199]:
df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [200]:
df.reset_index(drop=True)

    class  max_speed
0    bird      389.0
1    bird       24.0
2  mammal       80.5
3  mammal        NaN

In [201]:
index = pd.MultiIndex.from_tuples([('bird', 'falcon'),
                                   ('bird', 'parrot'),
                                   ('mammal', 'lion'),
                                   ('mammal', 'monkey')],
                                  names=['class', 'name'])

In [202]:
index

MultiIndex([(  'bird', 'falcon'),
            (  'bird', 'parrot'),
            ('mammal',   'lion'),
            ('mammal', 'monkey')],
           names=['class', 'name'])

In [203]:
columns = pd.MultiIndex.from_tuples([('speed', 'max'),
                                     ('species', 'type')])

In [204]:
columns

MultiIndex([(  'speed',  'max'),
            ('species', 'type')],
           )

In [205]:
df = pd.DataFrame([(389.0, 'fly'),
                   (24.0, 'fly'),
                   (80.5, 'run'),
                   (np.nan, 'jump')],
                  index=index,
                  columns=columns)

In [206]:
df

               speed species
                 max    type
class  name
bird   falcon  389.0     fly
       parrot   24.0     fly
mammal lion     80.5     run
       monkey    NaN    jump

In [207]:
df.reset_index(names=['classes', 'names'])

  classes   names  speed species
                     max    type
0    bird  falcon  389.0     fly
1    bird  parrot   24.0     fly
2  mammal    lion   80.5     run
3  mammal  monkey    NaN    jump

In [208]:
df.reset_index(level='class')

         class  speed species
                  max    type
name
falcon    bird  389.0     fly
parrot    bird   24.0     fly
lion    mammal   80.5     run
monkey  mammal    NaN    jump

In [209]:
df.reset_index(level='class', col_level=1)

                speed species
         class    max    type
name
falcon    bird  389.0     fly
parrot    bird   24.0     fly
lion    mammal   80.5     run
monkey  mammal    NaN    jump

In [210]:
df.reset_index(level='class', col_level=1, col_fill='species')

       species  speed species
         class    max    type
name
falcon    bird  389.0     fly
parrot    bird   24.0     fly
lion    mammal   80.5     run
monkey  mammal    NaN    jump

In [211]:
df.reset_index(level='class', col_level=1, col_fill='genus')

         genus  speed species
         class    max    type
name
falcon    bird  389.0     fly
parrot    bird   24.0     fly
lion    mammal   80.5     run
monkey  mammal    NaN    jump

In [212]:
df = pd.DataFrame({'num_legs': [2, 4, 8, 0],
                   'num_wings': [2, 0, 0, 0],
                   'num_specimen_seen': [10, 2, 1, 8]},
                  index=['falcon', 'dog', 'spider', 'fish'])

In [213]:
df

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10
dog            4          0                  2
spider         8          0                  1
fish           0          0                  8

In [214]:
df['num_legs'].sample(n=3, random_state=1)

fish      0
spider    8
falcon    2
Name: num_legs, dtype: int64

In [215]:
df.sample(frac=0.5, replace=True, random_state=1)

      num_legs  num_wings  num_specimen_seen
dog          4          0                  2
fish         0          0                  8

In [216]:
df.sample(frac=2, replace=True, random_state=1)

        num_legs  num_wings  num_specimen_seen
dog            4          0                  2
fish           0          0                  8
falcon         2          2                 10
falcon         2          2                 10
fish           0          0                  8
dog            4          0                  2
fish           0          0                  8
dog            4          0                  2

In [217]:
df.sample(n=2, weights='num_specimen_seen', random_state=1)

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10
fish           0          0                  8

In [219]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})

In [220]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [221]:
df.set_axis(['a', 'b', 'c'], axis='index')

   A  B
a  1  4
b  2  5
c  3  6

In [222]:
df.set_axis(['I', 'II'], axis='columns')

   I  II
0  1   4
1  2   5
2  3   6

In [223]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})

In [224]:
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [225]:
df.set_index('month')

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [226]:
df.set_index(['year', 'month'])

            sale
year month
2012 1        55
2014 4        40
2013 7        84
2014 10       31

In [227]:
df.set_index([pd.Index([1, 2, 3, 4]), 'year'])

        month  sale
  year
1 2012      1    55
2 2014      4    40
3 2013      7    84
4 2014     10    31

In [228]:
s = pd.Series([1, 2, 3, 4])

In [229]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [230]:
df.set_index([s, s**2])

      month  year  sale
1 1       1  2012    55
2 4       4  2014    40
3 9       7  2013    84
4 16     10  2014    31

In [231]:
df = pd.DataFrame([('falcon', 'bird', 389.0),
                   ('parrot', 'bird', 24.0),
                   ('lion', 'mammal', 80.5),
                   ('monkey', 'mammal', np.nan)],
                  columns=['name', 'class', 'max_speed'],
                  index=[0, 2, 3, 1])
df

     name   class  max_speed
0  falcon    bird      389.0
2  parrot    bird       24.0
3    lion  mammal       80.5
1  monkey  mammal        NaN

In [232]:
df.take([0, 3])

     name   class  max_speed
0  falcon    bird      389.0
1  monkey  mammal        NaN

In [233]:
df.take([1, 2], axis=1)

    class  max_speed
0    bird      389.0
2    bird       24.0
3  mammal       80.5
1  mammal        NaN

In [234]:
df.take([-1, -2])

     name   class  max_speed
1  monkey  mammal        NaN
3    lion  mammal       80.5

In [235]:
df = pd.DataFrame({'A': ['a', 'b', 'c', 'd', 'e'],
                   'B': ['f', 'g', 'h', 'i', 'j'],
                   'C': ['k', 'l', 'm', 'n', 'o']},
                  index=[1, 2, 3, 4, 5])

In [236]:
df

   A  B  C
1  a  f  k
2  b  g  l
3  c  h  m
4  d  i  n
5  e  j  o

In [237]:
df.truncate(before=2, after=4)

   A  B  C
2  b  g  l
3  c  h  m
4  d  i  n

In [238]:
df.truncate(before="A", after="B", axis="columns")

   A  B
1  a  f
2  b  g
3  c  h
4  d  i
5  e  j

In [239]:
df['A'].truncate(before=2, after=4)

2    b
3    c
4    d
Name: A, dtype: object

In [240]:
dates = pd.date_range('2016-01-01', '2016-02-01', freq='s')

In [241]:
dates

DatetimeIndex(['2016-01-01 00:00:00', '2016-01-01 00:00:01',
               '2016-01-01 00:00:02', '2016-01-01 00:00:03',
               '2016-01-01 00:00:04', '2016-01-01 00:00:05',
               '2016-01-01 00:00:06', '2016-01-01 00:00:07',
               '2016-01-01 00:00:08', '2016-01-01 00:00:09',
               ...
               '2016-01-31 23:59:51', '2016-01-31 23:59:52',
               '2016-01-31 23:59:53', '2016-01-31 23:59:54',
               '2016-01-31 23:59:55', '2016-01-31 23:59:56',
               '2016-01-31 23:59:57', '2016-01-31 23:59:58',
               '2016-01-31 23:59:59', '2016-02-01 00:00:00'],
              dtype='datetime64[ns]', length=2678401, freq='s')

In [242]:
df = pd.DataFrame(index=dates, data={'A': 1})

In [243]:
df

                     A
2016-01-01 00:00:00  1
2016-01-01 00:00:01  1
2016-01-01 00:00:02  1
2016-01-01 00:00:03  1
2016-01-01 00:00:04  1
...                 ..
2016-01-31 23:59:56  1
2016-01-31 23:59:57  1
2016-01-31 23:59:58  1
2016-01-31 23:59:59  1
2016-02-01 00:00:00  1

[2678401 rows x 1 columns]

In [244]:
df.tail()

                     A
2016-01-31 23:59:56  1
2016-01-31 23:59:57  1
2016-01-31 23:59:58  1
2016-01-31 23:59:59  1
2016-02-01 00:00:00  1

In [245]:
df.truncate(before=pd.Timestamp('2016-01-05'),
            after=pd.Timestamp('2016-01-10')).tail()

                     A
2016-01-09 23:59:56  1
2016-01-09 23:59:57  1
2016-01-09 23:59:58  1
2016-01-09 23:59:59  1
2016-01-10 00:00:00  1

In [246]:
df.truncate('2016-01-05', '2016-01-10').tail()

                     A
2016-01-09 23:59:56  1
2016-01-09 23:59:57  1
2016-01-09 23:59:58  1
2016-01-09 23:59:59  1
2016-01-10 00:00:00  1

In [247]:
df.loc['2016-01-05':'2016-01-10', :].tail()

                     A
2016-01-10 23:59:55  1
2016-01-10 23:59:56  1
2016-01-10 23:59:57  1
2016-01-10 23:59:58  1
2016-01-10 23:59:59  1

In [248]:
s = pd.Series([1, None, None, 2])
s.bfill()

0    1.0
1    2.0
2    2.0
3    2.0
dtype: float64

In [249]:
s

0    1.0
1    NaN
2    NaN
3    2.0
dtype: float64

In [250]:
df = pd.DataFrame({'A': [1, None, None, 4], 'B': [None, 5, None, 7]})
df

     A    B
0  1.0  NaN
1  NaN  5.0
2  NaN  NaN
3  4.0  7.0

In [251]:
df.bfill()

     A    B
0  1.0  5.0
1  4.0  5.0
2  4.0  7.0
3  4.0  7.0

In [252]:
df.bfill(limit=1)

     A    B
0  1.0  5.0
1  NaN  5.0
2  4.0  7.0
3  4.0  7.0

In [253]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [254]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [255]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [256]:
df.dropna(axis='columns')

       name
0    Alfred
1    Batman
2  Catwoman

In [257]:
df.dropna(how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [258]:
df.dropna(thresh=2)

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [259]:
df.dropna(subset=['name', 'toy'])

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [260]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                  columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [261]:
df.ffill()

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  4.0 NaN  1.0
3  3.0  3.0 NaN  4.0

In [262]:
ser = pd.Series([1, np.nan, 2, 3])

In [263]:
ser.ffill()

0    1.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [264]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                  columns=list("ABCD"))

In [265]:
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [266]:
df.fillna(0)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  0.0  3.0  0.0  4.0

In [267]:
values = {"A": 0, "B": 1, "C": 2, "D": 3}

In [268]:
values

{'A': 0, 'B': 1, 'C': 2, 'D': 3}

In [269]:
df.fillna(value=values)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  0.0  3.0  2.0  4.0

In [270]:
df.fillna(value=values, limit=1)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  NaN  1.0
2  NaN  1.0  NaN  3.0
3  NaN  3.0  NaN  4.0

In [271]:
df2 = pd.DataFrame(np.zeros((4, 4)), columns=list("ABCE"))

In [272]:
df.fillna(df2)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  NaN
3  0.0  3.0  0.0  4.0

In [273]:
s = pd.Series([0, 1, np.nan, 3])
s

0    0.0
1    1.0
2    NaN
3    3.0
dtype: float64

In [274]:
s.interpolate()

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [275]:
s = pd.Series([0, 2, np.nan, 8])
s.interpolate(method='polynomial', order=2)

0    0.000000
1    2.000000
2    4.666667
3    8.000000
dtype: float64

In [276]:
s

0    0.0
1    2.0
2    NaN
3    8.0
dtype: float64

In [277]:
df = pd.DataFrame([(0.0, np.nan, -1.0, 1.0),
                   (np.nan, 2.0, np.nan, np.nan),
                   (2.0, 3.0, np.nan, 9.0),
                   (np.nan, 4.0, -4.0, 16.0)],
                  columns=list('abcd'))

In [278]:
df

     a    b    c     d
0  0.0  NaN -1.0   1.0
1  NaN  2.0  NaN   NaN
2  2.0  3.0  NaN   9.0
3  NaN  4.0 -4.0  16.0

In [279]:
df.interpolate(method='linear', limit_direction='forward', axis=0)

     a    b    c     d
0  0.0  NaN -1.0   1.0
1  1.0  2.0 -2.0   5.0
2  2.0  3.0 -3.0   9.0
3  2.0  4.0 -4.0  16.0

In [280]:
df['d'].interpolate(method='polynomial', order=2)

0     1.0
1     4.0
2     9.0
3    16.0
Name: d, dtype: float64